The one of parameters for the fitting is causing the geometry to fail.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FittingParamsCauseGeometryToFailWarning { get; }
  Visual Basic
Public Shared ReadOnly Property FittingParamsCauseGeometryToFailWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FittingParamsCauseGeometryToFailWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace